Revit 2027 API
ExternalFileReference.GetLinkedFileStatus Method
 Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkedFileStatus GetLinkedFileStatus()
Public Function GetLinkedFileStatus As LinkedFileStatus
public:
LinkedFileStatus GetLinkedFileStatus()
member GetLinkedFileStatus : unit -> LinkedFileStatus
Return Value
LinkedFileStatus
Remarks
 Options are Invalid, Loaded, Unloaded, NotFound, or Imported.
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace